package com.company;

public class Main {

    public static void main(String[] args) {
        Cirlce cirlce = new Cirlce();
        cirlce.draw();

        Bread bread = new Bread();
        bread.bake();


        // 1. Что такое interface?
//        средство для взаимодействия пользователя с программой.
//        2. В чем отличие interface от обычного класса?
//        интерфейсы имплементят, классы экстендят
//        интерфесы могут экстендить друг друга в неограниченном количестве
//        интерфейсы можно имплементить в неограниченном количсетве
//        при имплементации интерфейса обязательно надо перезаписать все методы интерфейса
//        или обьявить класс абстрактным
//        3. Объясните применение interface.
//        интерфейсы нужны для присвоения действий классам
//        4. Отличие interface от abstract класса?
//        хз
//        5. Что такое ссылка?
//        своеобразный адрес для программы
//        6. Как можно использовать ссылку типа родительского класса для других объектов типа наследник?
//        записать обьект в переменную с типом родительсокго класса

//        4 реально хз
    }
}
